[
    {
        "day": "1",
        "is_not_template": true,
        "date": "4/18/24",
        "content": "Started Repo and Vite App and chose to try and do the 100 projects in 100 days, or at least code 100 days"
    },
    {
        "day": "2",
        "is_not_template": true,
        "date": "4/19/24",
        "content": "Made some updates to the general code template"
    },
    {
        "day": "3",
        "is_not_template": true,
        "date": "4/20/24",
        "content": "More template updates"
    },
    {
        "day": "4",
        "is_not_template": true,
        "date": "4/21/24",
        "content": "Started coming up with project ideas but generally more template updates"
    },
    {
        "day": "5",
        "is_not_template": true,
        "date": "4/22/24",
        "content": "Added some styling today and started and completed 1 project as well as some more updates to the base react app.  Background Color Changer Project started and completed"
    },
    {
        "day": "5.5",
        "is_not_template": true,
        "date": "4/22-23/24",
        "content": "Apparently I found my codjo - you know mojo but for coders.  I can't seem to stop playing around with different parts of this project.  Not complaining, it feels good"
    },
    {
        "day": "6",
        "is_not_template": true,
        "date": "4/23/24",
        "content": "So came up with some project ideas today.  Still playing with styling and such.  But why not.  Gonna use this log project in another project, a blog.  Of course that means I will have to edit the file that the logs are on to add a few things but why not... why make another file...although I might still do that...."
    },
    {
        "day": "19",
        "is_not_template": true,
        "date": "5/7/24",
        "content": "Finally getting back into the project for real again."
    },
    {
        "day": "20",
        "is_not_template": true,
        "date": "5/8/24",
        "content": "Finished 1 project, the important dates.... although I am thinking I might make adjustments, I certainly need to make some CSS adjustments for sure. I also came up with (with a suggestion from a fellow developer) 2 more project ideas."
    },
    {
        "day": "26",
        "is_not_template": true,
        "date": "5/14/24",
        "content": "Today was just a CSS day.  I didn't do much just cleaned some of it up."
    },
    {
        "day": "50",
        "is_not_template": true,
        "date": "6/7/24",
        "content": "To today is day 50 and what I have realized is I haven't been keeping up with this log for 1.  I am not even close to 50 project yet for 2. And I have more ideas or started projects than finished ones. So that needs to change. "
    },
    {
        "day": "51",
        "is_not_template": true,
        "date": "6/8/24",
        "content": "Came up with one new idea and revisited a very old project idea but adding it to this. Made more CSS updates yesterday. Added a new field to the project json of notes, not sure if I will display this or not, but this will serve as just that notes about the project like ideas of what I want to do outside of the title and description. Also added a dummyDB folder inside the json folder to serve as just that dummy database files so that any projects that are external and have a database I can give a rough example of what the real version will look like with some dummy data, this might also help in planning those external projects better by understanding how I want to organize things."
    },
    {
        "day": "56",
        "is_not_template": true,
        "date": "June 13th, 2024",
        "content": "So I have decided that for certain projects such as the log one although things might get added like new entries or updating CSS or maybe a new feature that if the original idea is reached I can call it finished.  Other wise some may never be finished."
    },
    {
        "day": "83",
        "is_not_template": true,
        "date": "July 10th, 2024",
        "content": "Finally getting back into this again.  Added some small updates to the challenges project. Although technically I have been working on this.. but just not the code.  Been working on my http status code images. Have almost all of the base images created been working on making them transparent and adding a frame too."
    },
    {
        "day": "306",
        "is_not_template": true,
        "date": "February 18, 2025",
        "content": "Been a while since I updatd the site but I did some cosmetic updates today.  Mostly updating or removing things I no longer want to be part of this."
    },
    {
        "day": "",
        "is_not_template": false,
        "date": "",
        "content": ""
    }
]