[
    {
        "day": "1",
        "is_not_template": true,
        "date": "4/18/24",
        "content": "Started Repo and Vite App and chose to try and do the 100 projects in 100 days, or at least code 100 days"
    },
    {
        "day": "2",
        "is_not_template": true,
        "date": "4/19/24",
        "content": "Made some updates to the general code template"
    },
    {
        "day": "3",
        "is_not_template": true,
        "date": "4/20/24",
        "content": "More template updates"
    },
    {
        "day": "4",
        "is_not_template": true,
        "date": "4/21/24",
        "content": "Started coming up with project ideas but generally more template updates"
    },
    {
        "day": "5",
        "is_not_template": true,
        "date": "4/22/24",
        "content": "Added some styling today and started and completed 1 project as well as some more updates to the base react app.  Background Color Changer Project started and completed"
    },
    {
        "day": "5.5",
        "is_not_template": true,
        "date": "4/22-23/24",
        "content": "Apparently I found my codjo - you know mojo but for coders.  I can't seem to stop playing around with different parts of this project.  Not complaining, it feels good"
    },
    {
        "day": "6",
        "is_not_template": true,
        "date": "4/23/24",
        "content": "So came up with some project ideas today.  Still playing with styling and such.  But why not.  Gonna use this log project in another project, a blog.  Of course that means I will have to edit the file that the logs are on to add a few things but why not... why make another file...although I might still do that...."
    },
    {
        "day": "19",
        "is_not_template": true,
        "date": "5/7/24",
        "content": "Finally getting back into the project for real again."
    },
    {
        "day": "20",
        "is_not_template": true,
        "date": "5/8/24",
        "content": "Finished 1 project, the important dates.... although I am thinking I might make adjustments, I certainly need to make some CSS adjustments for sure. I also came up with (with a suggestion from a fellow developer) 2 more project ideas."
    },
    {
        "day": "26",
        "is_not_template": true,
        "date": "5/14/24",
        "content": "Today was just a CSS day.  I didn't do much just cleaned some of it up."
    },
    {
        "day": "50",
        "is_not_template": true,
        "date": "6/7/24",
        "content": "To today is day 50 and what I have realized is I haven't been keeping up with this log for 1.  I am not even close to 50 project yet for 2. And I have more ideas or started projects than finished ones. So that needs to change. "
    },
    {
        "day": "",
        "is_not_template": false,
        "date": "",
        "content": ""
    }
]